w4/cats99/app/controllers/cat_rental_requests_controller.rb

  def index
    @cat_rental_requests = CatRentalRequest.all
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"

  def create
    @cats = Cat.all
    @cat_rental_request = CatRentalRequest.new(params[:cat_rental_request])
    # render :json => params
    if @cat_rental_request.save
---
SELECT "cats".* FROM "cats"
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)