w4/cats99/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = 2 ORDER BY start_date
---
  def show
    @cat = Cat.find(params[:id])
    @requests = @cat.rental_requests.order("start_date")

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "cats" SET "name" = 'Frangelica', "age" = 8, "color" = 'brown', "updated_at" = '2013-10-10 21:59:40.661509' WHERE "cats"."id" = 1
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(params[:cat])