w7/news/app/controllers/feeds_controller.rb

  def index
    respond_to do |format|
      format.html { render :index }
      format.json { render :json => Feed.all }
---
SELECT "feeds".* FROM "feeds"

  def show
    @feed = Feed.find(params[:id])
    if(@feed.entries.last.updated_at < 10.seconds.ago)
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = 6 ORDER BY "entries"."id" DESC LIMIT 1