w7/gistApp/app/controllers/favorites_controller.rb

  def create
    @favorite = current_user.favorites.create({gist_id: params[:gist_id]})
---
INSERT INTO "favorites" ("created_at", "gist_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 31 Oct 2013 21:17:16 UTC +00:00], ["gist_id", 2], ["updated_at", Thu, 31 Oct 2013 21:17:16 UTC +00:00], ["user_id", 1]]

  def destroy
    @favorite = Favorite.find_by_gist_id_and_user_id(params[:gist_id], current_user.id)
    @favorite.destroy()
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."gist_id" = 2 AND "favorites"."user_id" = 1 LIMIT 1
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 8]]