w7/gistApp/app/controllers/gists_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."gist_id" IN (1, 2)
SELECT "gist_files".* FROM "gist_files" WHERE "gist_files"."gist_id" IN (1, 2, 3, 4, 5, 6)
SELECT "gists".* FROM "gists" WHERE "gists"."user_id" = 1
---
  def index
    @user = current_user.gists.includes(:favorites,:gist_files, :tags);

INSERT INTO "gists" ("created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 31 Oct 2013 22:14:04 UTC +00:00], ["title", "asdf"], ["updated_at", Thu, 31 Oct 2013 22:14:04 UTC +00:00], ["user_id", 1]]
---
  def create
    @gist = current_user.gists.new(params[:gist]);
    if @gist.save