w7/gistApp/app/views/root/root.html.erb

SELECT "tags".* FROM "tags"
---
  });
  GistApp.TAGS = <%= Tag.all.to_json.html_safe %>